{
  "data": [
    {
      "id": 1,
      "name": "Em alta",
      "movies": [
        {
          "id": 1396,
          "name": "Breaking Bad: A Química do Mal",
          "overview": "Ao saber que tem câncer, um professor passa a fabricar metanfetamina pelo futuro da família, mudando o destino de todos.",
          "posterPath": "/30erzlzIOtOK3k3T3BAl1GiVMP1.jpg"
        },
        {
          "id": 799876,
          "name": "O Alfaiate",
          "overview": "Leonard, um alfaiate inglês costumava fazer ternos na mundialmente famosa Savile Row de Londres. Mas depois de uma tragédia pessoal, ele acabou em Chicago, operando uma pequena alfaiataria em uma parte difícil da cidade, onde ele faz roupas bonitas para as únicas pessoas ao redor que podem pagá-las: uma família de gangsters cruéis.",
          "posterPath": "/hKu1P98TtARG8wz5VSXIe28vfrG.jpg"
        },
        {
          "id": 436270,
          "name": "Adão Negro",
          "overview": "Quase 5.000 anos depois de ter sido concedido com os poderes onipotentes dos deuses egípcios - e de ter sido preso, - Adão Negro se ergue de seu túmulo, pronto para trazer sua justiça ao mundo moderno.",
          "posterPath": "/3zXceNTtyj5FLjwQXuPvLYK5YYL.jpg"
        },
        {
          "id": 675353,
          "name": "Sonic 2 - O Filme",
          "overview": "Depois de se estabelecer em Green Hills, Sonic está pronto para mais liberdade e deixar sua marca como um herói, e Tom e Maddie concordam em deixá-lo em casa enquanto vão de férias. Mas, assim que eles se foram, Dr. Robotnik volta, desta vez com um novo parceiro, Knuckles, em busca de uma esmeralda que tem o poder de construir e destruir civilizações. Sonic se une a um novo companheiro, Tails, e juntos eles embarcam em uma jornada para encontrar a esmeralda antes que ela caia nas mãos erradas.",
          "posterPath": "/f4SvCKIUrC2cDR7Xo4k1kaGAqQ2.jpg"
        },
        {
          "id": 125940,
          "name": "Vampire Academy",
          "overview": "In a world of privilege and glamour, two young women’s friendship transcends their strikingly different classes as they prepare to complete their education and enter royal vampire society. Based on the young adult novels by Richelle Mead.",
          "posterPath": "/fVwWkJBbOtxM7VKg7PS1IkjYpQc.jpg"
        },
        {
          "id": 127585,
          "name": "Gigolô Americano",
          "overview": "Libertado após quinze anos de prisão por um assassinato que não cometeu, o ex-gigolô Julian Kaye enfrenta o desafio de se reerguer enquanto o detetive que o colocou atrás das grades tenta desvendar o mistério que o levou à prisão.",
          "posterPath": "/6r9GIhaf20cG8ndJp9jdtxsBTuX.jpg"
        },
        {
          "id": 90802,
          "name": "Sandman",
          "overview": "Um mago tenta capturar a Morte para barganhar pela vida eterna, no entanto, acaba prendendo seu irmão mais novo, Sonho. Temendo por sua segurança, o mago o mantém preso em uma garrafa de vidro por décadas. Após sua fuga, Sonho, também conhecido como Morpheus, parte em busca de seus poderosos objetos perdidos.",
          "posterPath": "/q54qEgagGOYCq5D1903eBVMNkbo.jpg"
        },
        {
          "id": 155226,
          "name": "Big Mouse: De Vigarista a Vingador",
          "overview": "Um advogado com uma taxa de sucesso de dez por cento é pego em um caso de assassinato e se torna Big Mouse, o vigarista notório e genial, da noite para o dia. Para sobreviver e proteger sua família, ele tenta revelar a verdadeira face das pessoas privilegiadas envolvidas em uma enorme conspiração.",
          "posterPath": "/3UUoSGIKylNmJf1qC2tVhpNDv3V.jpg"
        },
        {
          "id": 744,
          "name": "Top Gun - Ases Indomáveis",
          "overview": "A escola naval de pilotos é onde o melhor dos melhores treinam para refinar suas habilidades de voo de elite. Quando o piloto Maverick é enviado para a escola, sua atitude irresponsável e comportamento arrogante o colocam em desacordo com os outros pilotos, especialmente Iceman. Porém Maverick não está apenas competindo para ser o piloto superior de caça, ele também está lutando pela atenção de sua bonita instrutora de voo, Charlotte Blackwood.",
          "posterPath": "/dDrMtnVgtDeecIgNchb9F8JcO5w.jpg"
        },
        {
          "id": 299534,
          "name": "Vingadores: Ultimato",
          "overview": "Após os eventos devastadores de \"Vingadores: Guerra Infinita\", o universo está em ruínas devido aos esforços do Titã Louco, Thanos. Com a ajuda de aliados remanescentes, os Vingadores devem se reunir mais uma vez a fim de desfazer as ações de Thanos e restaurar a ordem no universo de uma vez por todas, não importando as consequências.",
          "posterPath": "/q6725aR8Zs4IwGMXzZT8aC8lh41.jpg"
        },
        {
          "id": 118189,
          "name": "A Rainha Serpente",
          "overview": "Conta a história de Catarina de Médici, que, apesar de todas as dificuldades, se tornou uma das regentes mais poderosas e longevas da história da França. A história de Catarina é contada por meio de retrospectos, enquanto ela defende suas ações e compartilha as lições que aprendeu com sua nova criada, Rahima.",
          "posterPath": "/1ZHimZQ8xz8PN7RASXd0Liikivb.jpg"
        },
        {
          "id": 1402,
          "name": "The Walking Dead",
          "overview": "Nos Estados Unidos pós-apocalíptico, um pequeno grupo de sobreviventes segue viajando à procura de uma nova casa longe dos mortos-vivos. O desespero por segurança e suprimentos os coloca constantemente à beira da sanidade.",
          "posterPath": "/xf9wuDcqlUPWABZNeDKPbZUjWx0.jpg"
        },
        {
          "id": 671,
          "name": "Harry Potter e a Pedra Filosofal",
          "overview": "Harry Potter é um garoto órfão que vive infeliz com seus tios, os Dursley. Em seu aniversário de 11 anos ele recebe uma carta que mudará sua vida: um convite para ingressar em Hogwarts.",
          "posterPath": "/l1FfRmKRNXRSqXT5GlMo16MX2LX.jpg"
        },
        {
          "id": 135250,
          "name": "Mike: Além de Tyson",
          "overview": "Explore a vida e a carreira selvagem, trágica e controversa do campeão dos pesos pesados ​​Mike Tyson - uma das figuras mais polarizadoras da cultura esportiva.",
          "posterPath": "/2cZCfifyh5ElYv0rbFFqkqs0bp5.jpg"
        },
        {
          "id": 60059,
          "name": "Better Call Saul",
          "overview": "Antes de se transformar no infame Saul Goodman, o advogado de Breaking Bad era mais inocente, mas não era santo.",
          "posterPath": "/4g3UBFRKrA3Iq3wilqHhAIpQdTN.jpg"
        },
        {
          "id": 299536,
          "name": "Vingadores: Guerra Infinita",
          "overview": "Homem de Ferro, Thor, Hulk e os Vingadores se unem para combater seu inimigo mais poderoso, o maligno Thanos. Em uma missão para coletar todas as seis pedras infinitas, Thanos planeja usá-las para infligir sua vontade maléfica sobre a realidade.",
          "posterPath": "/89QTZmn34iwXYeCpVxhC9UrT8sX.jpg"
        },
        {
          "id": 338953,
          "name": "Animais Fantásticos: Os Segredos de Dumbledore",
          "overview": "O professor Alvo Dumbledore sabe que o poderoso mago das trevas Gellert Grindelwald está se movimentando para assumir o controle do mundo mágico. Incapaz de detê-lo sozinho, ele pede ao magizoologista Newt Scamander para liderar uma intrépida equipe de bruxos, bruxas e um corajoso padeiro trouxa em uma missão perigosa, em que eles encontram velhos e novos animais fantásticos e entram em conflito com a crescente legião de seguidores de Grindelwald. Mas com tantas ameaças, quanto tempo poderá Dumbledore permanecer à margem do embate?",
          "posterPath": "/gopGghuMtmdMviBcl9G0JfVB2RZ.jpg"
        },
        {
          "id": 911129,
          "name": "Paixão Sufocante",
          "overview": "Com um visual arrebatador, este drama conta a história de um amor profundo e destrutivo entre uma mergulhadora talentosa e seu instrutor de mergulho livre.",
          "posterPath": "/kYIPV5vcZOKWiKleJCmZvHAjnBk.jpg"
        },
        {
          "id": 760104,
          "name": "X: A Marca da Morte",
          "overview": "Em 1979, um grupo de jovens cineastas se propôs a fazer um filme adulto na zona rural do Texas, mas quando seus solitários e idosos anfitriões os pegam em flagrante, o elenco se vê lutando por suas vidas.",
          "posterPath": "/cWPUgYfXcY9mqKf6RwjwuvhjQjU.jpg"
        },
        {
          "id": 862551,
          "name": "De Férias da Família",
          "overview": "Quando a família toda viaja, um pai dono de casa se depara com um tempo só para ele. Seu melhor amigo das antigas reaparece e eles aproveitam um final de semana épico, que quase vira a vida dele de cabeça para baixo.",
          "posterPath": "/mGPFbEmWdaDVxO5V64xYwv6v8j.jpg"
        }
      ]
    }
  ]
}
